src/DataProcessors/StackMachine.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>StackMachine</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>EntryPoint</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentPoin</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CodeText</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentString</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Function</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исп</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПеременных</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоМеток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/Значения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Значения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Значение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/Stack.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Stack</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отладка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Строка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АдресУДС</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шаг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипЗначенияПамяти</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/History.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>History</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>opCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Operand</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ном</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Строка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/StackTMP.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>StackTMP</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отладка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Строка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипЗначенияПамяти</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/Значение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Значение</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>CodeText</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EntryPoint</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CurrentPoin</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CurrentString</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Файл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JSON</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/StackMachine/Forms/Форма/Ext/Form/Module.bsl
//*****************************************************************************************
&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	//Если ВыбранныеФайлы <> Неопределено Тогда
	//	
	//	Объект.Файл = ВыбранныеФайлы[0];
	//	
	//	ОбработатьФайл();

	//	Элементы.ЭлементыCode.Обновить();
	//	Элементы.ЭлементыStack.Обновить();
	//	Элементы.ЭлементыMemory.Обновить();
	//	
	//	ОбновитьДанные(); 

	//	ПоказатьПредупреждение(, "Загрузка данных завершена");
	//	
	//КонецЕсли;
	
КонецПроцедуры
//*****************************************************************************************
//&НаКлиенте
//Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	СтандартнаяОбработка = Ложь;
//	
//	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
//	
//	Диалог.Фильтр	 = "Все файлы (*.*)|*.*";
//	Диалог.Заголовок = "Выберите файл";
//	
//	Диалог.Показать(Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект));
//	
//КонецПроцедуры
//*****************************************************************************************
&НаСервере
Функция ВыполнитьШагНаСервере()  

	Возврат Decompile.ВыполнитьШагОбработки();

КонецФункции
//*****************************************************************************************
&НаСервере
Функция ВыполнитьОдинШаг()  

	Возврат Decompile.ВыполнитьОдинШагОбработки();

КонецФункции
//*****************************************************************************************
&НаКлиенте
Процедура run(Команда) 

	ВыполнитьШагНаСервере();
	
	Элементы.ЭлементыCode.Обновить();
	Элементы.ЭлементыStack.Обновить();
	Элементы.ЭлементыMemory.Обновить();
	Элементы.ЭлементыHistory.Обновить();
	Элементы.ЭлементыStackTMP.Обновить();

	ОбновитьCurrnetPoinНаСервере();

КонецПроцедуры
//*****************************************************************************************
&НаКлиенте
Процедура step(Команда)

	ВыполнитьОдинШаг();
	
	Элементы.ЭлементыCode.Обновить();
	Элементы.ЭлементыStack.Обновить();
	Элементы.ЭлементыMemory.Обновить();
	Элементы.ЭлементыHistory.Обновить();
	Элементы.ЭлементыStackTMP.Обновить();
	
	ОбновитьCurrnetPoinНаСервере();

КонецПроцедуры
//*****************************************************************************************
&НаСервере
Процедура ОбновитьДанные()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Значения.Тип КАК Тип,
	|	Значения.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.Значения КАК Значения");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		Для Каждого Значение Из Метаданные.Перечисления.Значение.ЗначенияПеречисления Цикл 
			
			Если Значение.Синоним = Строка(Выборка.Тип) Тогда  	
				
				Попытка
					
					Объект[Значение.Имя] = Выборка.Значение.Получить();     
					
				Исключение
					
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла; 

	Элементы.Файл.Доступность = НЕ ЗначениеЗаполнено(Объект.Файл); 

КонецПроцедуры
//*****************************************************************************************
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьДанные(); 

КонецПроцедуры
//*****************************************************************************************
&НаСервере
Процедура ОбновитьCurrnetPoinНаСервере()

	Объект.CodeText		 = Decompile.ПолучитьЗначениеПоТипу(Перечисления.Значение.CodeText, "");
	Объект.CurrentPoin	 = Decompile.ПолучитьЗначениеНастроек(Перечисления.Значение.CurrentPoin); 

КонецПроцедуры
//*****************************************************************************************
&НаСервере
Процедура CurrnetPoinПриИзмененииНаСервере()

	Decompile.УстановитьЗначениеНастроек(Перечисления.Значение.CurrnetPoin, Объект.CurrentPoin);
	
КонецПроцедуры
//*****************************************************************************************
&НаКлиенте
Процедура CurrnetPoinПриИзменении(Элемент)
	
	CurrnetPoinПриИзмененииНаСервере(); 
	
КонецПроцедуры
//***************************************************************************************** 
&НаСервереБезКонтекста
Процедура ЭлементыStackПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Stack.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.Stack КАК Stack
	|ГДЕ
	|	Stack.Адрес = &Адрес");
	
	Запрос.УстановитьПараметр("Адрес", Строки.ПолучитьКлючи()[0].Адрес);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		
		Попытка
			
			Строки.Получить(Строки.ПолучитьКлючи()[0]).Представление = Строка(Выборка.Значение.Получить());   
			
		Исключение
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры
//***************************************************************************************** 
&НаСервере
Процедура setНаСервере()  
	
	Константы.ТекущаяСтрока.Установить(1);  
	
КонецПроцедуры
//***************************************************************************************** 
&НаКлиенте
Процедура set(Команда)   
	
	setНаСервере(); 
	
КонецПроцедуры
//***************************************************************************************** 
&НаСервере
Процедура clearНаСервере()  
	
	History = РегистрыСведений.History.СоздатьНаборЗаписей();
	
	History.Записать();
	
	Stack = РегистрыСведений.Stack.СоздатьНаборЗаписей();
	
	Stack.Записать(); 
	
	StackTMP = РегистрыСведений.StackTMP.СоздатьНаборЗаписей();
	
	StackTMP.Записать();

	Decompile.УстановитьЗначениеНастроек(Перечисления.Значение.CodeText,	 "");
	Decompile.УстановитьЗначениеНастроек(Перечисления.Значение.CurrentPoin,	 -1);
	
КонецПроцедуры
//***************************************************************************************** 
&НаКлиенте
Процедура clear(Команда) 
	
	clearНаСервере();  
	
	Элементы.ЭлементыCode.Обновить();
	Элементы.ЭлементыStack.Обновить();
	Элементы.ЭлементыMemory.Обновить();
	Элементы.ЭлементыHistory.Обновить();
	Элементы.ЭлементыStackTMP.Обновить();

	ОбновитьCurrnetPoinНаСервере();

КонецПроцедуры
//*****************************************************************************************
